andrew-2.3.1/run/tutorials/multiphase/interDyMFoam/ras/sloshingTank2D3DoF/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   solidBodyMotionFvMesh;

solidBodyMotionFvMeshCoeffs
{
    solidBodyMotionFunction SDA;
    SDACoeffs
    {
        CofG            ( 0 0 0 );
        lamda           50;
        rollAmax        0.2;
        rollAmin        0.1;
        heaveA          4;
        swayA           2.4;
        Q               2;
        Tp              14;
        Tpn             12;
        dTi             0.06;
        dTp             -0.001;
    }
}


// ************************************************************************* //
